Repository: CarlosDDCmx/ProcesArchivos
Catalog: locale/*/LC_MESSAGES/messages.po
Languages: es

# idioma_estab
source: 🌐 Language set: {lang}
es: 🌐 Idioma establecido: {lang}

# salir_linea
source: Exit
es: Salir

# logger_error_inesp
source: ⚠️ An unhandled exception occurred
es: ⚠️ Se produjo una excepción no controlada

# desconocido
source: Unknown
es: Desconocido

source: reporte_bytes_insuf
es: ⚠️ Se solicitaron {requested} bytes pero el archivo solo tiene {actual} bytes.

# detector_error_lee
source: ❌ Error reading file: {error}
es: ❌ Error al leer el archivo: {error}

# error_firmas_carga
source: ⚠️ Couldn't load signature file: {error}
es: ⚠️ No se pudo cargar el archivo de firmas: {error}

source: loader_error
es: ⚠️ No se pudieron cargar las firmas del archivo: {error}

# reporte_ruta
source: 📝 File analyzed: {path}
es: 📝 Archivo analizado: {path}

# reporte_bytes
source: 📦 Size (bytes): {size}
es: 📦 Tamaño (bytes): {size}

# reporte_b_leido
source: 📦 Bytes read: {header_bytes}
es: 📦 Bytes leídos: {header_bytes}

# reporte_encabezado
source: 🔍 Header (hex): {header}
es: 🔍 Encabezado (hex): {header}

# reporte_extension
source: 📂 Extension: {extension}
es: 📂 Extensión: {extension}

# reporte_MIME
source: 📑 MIME Type: {mime_type}
es: 📑 Tipo MIME: {mime_type}

# reporte_tipo
source: 📌 Detected type: {detected_type}
es: 📌 Tipo detectado: {detected_type}

# ver_memoria
source: 🧠 View memory
es: 🧠 Ver memoria

source: seleccionar_archivo
es: 📂 Seleccionar archivo activo

# eleccion_entra
source: ➡️ Enter your choice:
es: ➡️ Ingresa tu elección:

# error_vacio
source: ❌ No value entered. Please try again.
es: Error: Vacío

# error_no_valido
source: ❌ Invalid option. Please try again.
es: ❌ Opción no valida}

# error_menu_const
source: ❌ Error building menu: {error}
es: ❌ Error al construir el menú: {error}

# error_menu_display
source: ❌ No menu to display
es: ❌ No hay menú para mostrar

# formato_no_soportado
source: ❌ Unsupported format: {mime_type}
es: ❌ Formato no soportado: {mime_type}

source: zip_error_invalido
es: ❌ Archivo ZIP inválido: {error}

source: zip_error_lectura
es: ❌ Error al leer ZIP {path}: {error}

# odf_cargando
source: ⏳ Reading OpenDocument…
es: ⏳ Leyendo documento OpenDocument…

# odf_leido
source: ✅ OpenDocument read: {parrafos} paragraphs
es: ✅ Documento OpenDocument leído: {parrafos} párrafos

# odf_stats_error
source: ❌ Error generating ODF statistics: {error}
es: ❌ Error al generar estadísticas ODF: {error}

# logger_error_crea_dir
source: ❌ Could not create logs directory: {error}
es: ❌ No se pudo crear directorio de logs: {error}

# inicio_app
source: ✅ Application started
es: ✅ Comienza aplicación

# verbose_hab
source: 🔍 Verbose mode enabled
es: 🔍 Modo verbose habilitado

# docx_cargando
source: ⏳ Reading DOCX document…
es: ⏳ Leyendo documento DOCX…

# docx_leido
source: ✅ DOCX document read: {parrafos} paragraphs
es: ✅ Documento DOCX leído: {parrafos} párrafos

source: docx_error_lectura
es: ❌ Error al leer DOCX: {error}

# xlsx_cargando
source: ⏳ Reading Excel document…
es: ⏳ Leyendo documento Excel…

# xlsx_leido_hojas
source: ✅ Excel document read: {hojas} sheets
es: ✅ Documento Excel leído: {hojas} hojas

source: xlsx_error_lectura
es: ❌ Error al leer Excel: {error}

# salir
source: 🚪 Exit
es: 🚪 Salir

# saluda_usuario
source: 👋 Hello, user!
es: 👋 ¡Hola, usuario!

source: sin_resultados
es: No hay resultados en la sesión

# archivo_activo_cambiado
source: ✅ Active file changed: {path}
es: ✅ Archivo activo cambiado: {path}

# parrafos_mas
source: paragraphs omitted
es: párrafos omitidos

# tablas_mas
source: tables omitted
es: tablas omitidas

# ruta_entra
source: 📄 Enter the file path:
es: 📄 Ingresa la ruta al archivo:

# bytes_entra
source: 🔢 How many header bytes do you want to read? (default: 8):
es: 🔢 ¿Cuántos bytes del encabezado deseas leer? (por defecto: 8):

# detector_falla
source: ❌ Error detecting file type: {error}
es: ❌ Error al detectar el tipo de archivo: {error}

# docx_no_activo
source: ❌ No active DOCX document to process.
es: ❌ No hay documento DOCX activo para procesar.

# docx_stats_titulo
source: 📊 DOCX Document Statistics:
es: 📊 Estadísticas del documento DOCX:

# docx_sin_metadata
source: ⚠️ No metadata found in the DOCX file.
es: ⚠️ No se encontraron metadatos en el archivo DOCX.

# docx_metadata_titulo
source: 📑 DOCX Document Metadata:
es: 📑 Metadatos del documento DOCX:

# sin_archivo_activo
source: ⚠️ No active file selected.
es: ⚠️ No hay un archivo activo seleccionado.

# error_no_soporta_metadatos
source: ❌ This document type does not support metadata.
es: ❌ Este tipo de documento no soporta metadatos.

# metadatos_obtenidos
source: 📑 Metadata:
es: 📑 Metadatos:

# error_lectura_metadatos
source: ❌ This document type does not support metadata
es: ❌ Este tipo de documento no soporta metadatos

# docs_no_activo
source: ❌ No active document to process
es: ❌ No hay documento activo para procesar

# docs_data_missing
source: ❌ First, read the document content.
es: ❌ Primero lee el contenido del documento.

# pptx_lectura_no_disponible
source: ⚠️ Function unavailable
es: ⚠️ Función no disponbile

# ods_leido
source: ✅ ODS document read: {hojas} sheets
es: ✅ Documento ODS leído: {hojas} hojas

# ods_error
source: ❌ Error processing spreadsheet: {error}
es: ❌ Error procesando hoja de cálculo: {error}

# stats_obtenidas
source: 📄 Statistics obtained
es: 📄 Estadísticas obtenidas

# volver
source: 🔙 Back
es: 🔙 Volver

# detector
source: 🔎 Detectors
es: 🔍 Detector

# menu_docs
source: 📖 Documents
es: 📖 Documentos

# docs_leer
source: 📄 Read content
es: 📄 Leer contenido

# docs_stats
source: 📊 Get statistics
es: 📊 Obtener estadísticas

# docs_meta
source: 📑 Read metadata
es: 📑 Leer metadatos

# leer_contenido
source: 📑 Read content
es: 📑Leer contenido

# menu_prin
source: 🏠 Main Menu
es: 🏠 Menú Principal

# herramientas
source: 🛠 Tools
es: 🛠 Herramientas

# saludar
source: 👋 Greet
es: 👋 Saludar

source: menu_pptx
es: 🏠 Menú Principal

# obtener_estadisticas
source: 📊 Get statistics
es: 📊 Obtener estadísticas

# obtener_metadatos
source: 📑 Read metadata
es: 📑 Leer metadatos
